app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT * FROM `comments`

  def create
    @comment = @track.comments.build(params[:comment])
    if @comment.save
---
INSERT INTO `comments` (`created_at`, `updated_at`, `track_id`, `user_id`, `content`) VALUES('2010-03-24 09:00:35', '2010-03-24 09:00:35', 1, 1, 'comment from drew')

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 298486374)
DELETE FROM `comments` WHERE `id` = 298486374