app/controllers/tracks_controller.rb

  def index
    @tracks = Track.all
---
SELECT * FROM `tracks` ORDER BY created_at DESC

  def show
    @track = Track.find(params[:id])
---
SELECT * FROM `tracks` WHERE (`tracks`.`id` = 1)

  def manage
    @tracks = Track.find(:all, :conditions => {:user_id => @current_user.id })
---
SELECT * FROM `tracks` WHERE (`tracks`.`user_id` = 1)

  def edit
    @track = Track.find(params[:id])
---
SELECT * FROM `tracks` WHERE (`tracks`.`id` = 1)

  def create
    @track = Track.new(params[:track])

    if @track.save
---
INSERT INTO `tracks` (`artist`, `audio_content_type`, `created_at`, `title`, `audio_updated_at`, `updated_at`, `user_id`, `audio_file_name`, `audio_file_size`) VALUES('Digital Freq', 'audio/mp3', '2010-03-31 08:19:20', 'Right Here, Right Now - Original Mix', '2010-03-31 08:19:20', '2010-03-31 08:19:20', 1, 'Right_Here_Right_Now_-_Original_Mix.mp3', 17933694)

  def destroy
    @track = Track.find(params[:id])
    @track.destroy
---
SELECT * FROM `tracks` WHERE (`tracks`.`id` = 298486374)
DELETE FROM `tracks` WHERE `id` = 298486374