app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2010-03-17 01:58:11', `image` = 'http://monospectra.com/temp/jap.jpg', `info` = 'Hello world.', `url` = 'http://monospectra.com' WHERE `id` = 1